MikroElektronika/core_packages/PIC/XC8/def/PIC18F55K42/mcu.h
// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0x3986);
#ifndef _LIB_BUILD
asm("IPR6 equ 03986h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2IP                 :1;
        unsigned I2C2EIP                :1;
        unsigned U2RXIP                 :1;
        unsigned U2TXIP                 :1;
        unsigned U2EIP                  :1;
        unsigned U2IP                   :1;
        unsigned TMR3IP                 :1;
        unsigned TMR3GIP                :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0x3986);
// bitfield macros
#define _IPR6_I2C2IP_POSN                                   0x0
#define _IPR6_I2C2IP_POSITION                               0x0
#define _IPR6_I2C2IP_SIZE                                   0x1
#define _IPR6_I2C2IP_LENGTH                                 0x1
#define _IPR6_I2C2IP_MASK                                   0x1
#define _IPR6_I2C2EIP_POSN                                  0x1
#define _IPR6_I2C2EIP_POSITION                              0x1
#define _IPR6_I2C2EIP_SIZE                                  0x1
#define _IPR6_I2C2EIP_LENGTH                                0x1
#define _IPR6_I2C2EIP_MASK                                  0x2
#define _IPR6_U2RXIP_POSN                                   0x2
#define _IPR6_U2RXIP_POSITION                               0x2
#define _IPR6_U2RXIP_SIZE                                   0x1
#define _IPR6_U2RXIP_LENGTH                                 0x1
#define _IPR6_U2RXIP_MASK                                   0x4
#define _IPR6_U2TXIP_POSN                                   0x3
#define _IPR6_U2TXIP_POSITION                               0x3
#define _IPR6_U2TXIP_SIZE                                   0x1
#define _IPR6_U2TXIP_LENGTH                                 0x1
#define _IPR6_U2TXIP_MASK                                   0x8
#define _IPR6_U2EIP_POSN                                    0x4
#define _IPR6_U2EIP_POSITION                                0x4
#define _IPR6_U2EIP_SIZE                                    0x1
#define _IPR6_U2EIP_LENGTH                                  0x1
#define _IPR6_U2EIP_MASK                                    0x10
#define _IPR6_U2IP_POSN                                     0x5
#define _IPR6_U2IP_POSITION                                 0x5
#define _IPR6_U2IP_SIZE                                     0x1
#define _IPR6_U2IP_LENGTH                                   0x1
#define _IPR6_U2IP_MASK                                     0x20
#define _IPR6_TMR3IP_POSN                                   0x6
#define _IPR6_TMR3IP_POSITION                               0x6
#define _IPR6_TMR3IP_SIZE                                   0x1
#define _IPR6_TMR3IP_LENGTH                                 0x1
#define _IPR6_TMR3IP_MASK                                   0x40
#define _IPR6_TMR3GIP_POSN                                  0x7
#define _IPR6_TMR3GIP_POSITION                              0x7
#define _IPR6_TMR3GIP_SIZE                                  0x1
#define _IPR6_TMR3GIP_LENGTH                                0x1
#define _IPR6_TMR3GIP_MASK                                  0x80

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0x3987);
#ifndef _LIB_BUILD
asm("IPR7 equ 03987h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IP                 :1;
        unsigned CCP2IP                 :1;
        unsigned                        :1;
        unsigned CWG2IP                 :1;
        unsigned CLC2IP                 :1;
        unsigned INT2IP                 :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0x3987);
// bitfield macros
#define _IPR7_TMR4IP_POSN                                   0x0
#define _IPR7_TMR4IP_POSITION                               0x0
#define _IPR7_TMR4IP_SIZE                                   0x1
#define _IPR7_TMR4IP_LENGTH                                 0x1
#define _IPR7_TMR4IP_MASK                                   0x1
#define _IPR7_CCP2IP_POSN                                   0x1
#define _IPR7_CCP2IP_POSITION                               0x1
#define _IPR7_CCP2IP_SIZE                                   0x1
#define _IPR7_CCP2IP_LENGTH                                 0x1
#define _IPR7_CCP2IP_MASK                                   0x2
#define _IPR7_CWG2IP_POSN                                   0x3
#define _IPR7_CWG2IP_POSITION                               0x3
#define _IPR7_CWG2IP_SIZE                                   0x1
#define _IPR7_CWG2IP_LENGTH                                 0x1
#define _IPR7_CWG2IP_MASK                                   0x8
#define _IPR7_CLC2IP_POSN                                   0x4
#define _IPR7_CLC2IP_POSITION                               0x4
#define _IPR7_CLC2IP_SIZE                                   0x1
#define _IPR7_CLC2IP_LENGTH                                 0x1
#define _IPR7_CLC2IP_MASK                                   0x10
#define _IPR7_INT2IP_POSN                                   0x5
#define _IPR7_INT2IP_POSITION                               0x5
#define _IPR7_INT2IP_SIZE                                   0x1
#define _IPR7_INT2IP_LENGTH                                 0x1
#define _IPR7_INT2IP_MASK                                   0x20

// Register: IPR8
#define IPR8 IPR8
extern volatile unsigned char           IPR8                __at(0x3988);
#ifndef _LIB_BUILD
asm("IPR8 equ 03988h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned TMR5IP                 :1;
        unsigned TMR5GIP                :1;
    };
} IPR8bits_t;
extern volatile IPR8bits_t IPR8bits __at(0x3988);
// bitfield macros
#define _IPR8_TMR5IP_POSN                                   0x6
#define _IPR8_TMR5IP_POSITION                               0x6
#define _IPR8_TMR5IP_SIZE                                   0x1
#define _IPR8_TMR5IP_LENGTH                                 0x1
#define _IPR8_TMR5IP_MASK                                   0x40
#define _IPR8_TMR5GIP_POSN                                  0x7
#define _IPR8_TMR5GIP_POSITION                              0x7
#define _IPR8_TMR5GIP_SIZE                                  0x1
#define _IPR8_TMR5GIP_LENGTH                                0x1
#define _IPR8_TMR5GIP_MASK                                  0x80

// Register: IPR9
#define IPR9 IPR9
extern volatile unsigned char           IPR9                __at(0x3989);
#ifndef _LIB_BUILD
asm("IPR9 equ 03989h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR6IP                 :1;
        unsigned CCP3IP                 :1;
        unsigned CWG3IP                 :1;
        unsigned CLC3IP                 :1;
    };
} IPR9bits_t;
