MikroElektronika/core_packages/PIC/XC8/def/PIC18F55K42/mcu.h
extern volatile IPR9bits_t IPR9bits __at(0x3989);
// bitfield macros
#define _IPR9_TMR6IP_POSN                                   0x0
#define _IPR9_TMR6IP_POSITION                               0x0
#define _IPR9_TMR6IP_SIZE                                   0x1
#define _IPR9_TMR6IP_LENGTH                                 0x1
#define _IPR9_TMR6IP_MASK                                   0x1
#define _IPR9_CCP3IP_POSN                                   0x1
#define _IPR9_CCP3IP_POSITION                               0x1
#define _IPR9_CCP3IP_SIZE                                   0x1
#define _IPR9_CCP3IP_LENGTH                                 0x1
#define _IPR9_CCP3IP_MASK                                   0x2
#define _IPR9_CWG3IP_POSN                                   0x2
#define _IPR9_CWG3IP_POSITION                               0x2
#define _IPR9_CWG3IP_SIZE                                   0x1
#define _IPR9_CWG3IP_LENGTH                                 0x1
#define _IPR9_CWG3IP_MASK                                   0x4
#define _IPR9_CLC3IP_POSN                                   0x3
#define _IPR9_CLC3IP_POSITION                               0x3
#define _IPR9_CLC3IP_SIZE                                   0x1
#define _IPR9_CLC3IP_LENGTH                                 0x1
#define _IPR9_CLC3IP_MASK                                   0x8

// Register: IPR10
#define IPR10 IPR10
extern volatile unsigned char           IPR10               __at(0x398A);
#ifndef _LIB_BUILD
asm("IPR10 equ 0398Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4IP                 :1;
        unsigned CLC4IP                 :1;
    };
} IPR10bits_t;
extern volatile IPR10bits_t IPR10bits __at(0x398A);
// bitfield macros
#define _IPR10_CCP4IP_POSN                                  0x0
#define _IPR10_CCP4IP_POSITION                              0x0
#define _IPR10_CCP4IP_SIZE                                  0x1
#define _IPR10_CCP4IP_LENGTH                                0x1
#define _IPR10_CCP4IP_MASK                                  0x1
#define _IPR10_CLC4IP_POSN                                  0x1
#define _IPR10_CLC4IP_POSITION                              0x1
#define _IPR10_CLC4IP_SIZE                                  0x1
#define _IPR10_CLC4IP_LENGTH                                0x1
#define _IPR10_CLC4IP_MASK                                  0x2

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x3990);
#ifndef _LIB_BUILD
asm("PIE0 equ 03990h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIE                   :1;
        unsigned HLVDIE                 :1;
        unsigned OSFIE                  :1;
        unsigned CSWIE                  :1;
        unsigned NVMIE                  :1;
        unsigned SCANIE                 :1;
        unsigned CRCIE                  :1;
        unsigned IOCIE                  :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0x3990);
// bitfield macros
#define _PIE0_SWIE_POSN                                     0x0
#define _PIE0_SWIE_POSITION                                 0x0
#define _PIE0_SWIE_SIZE                                     0x1
#define _PIE0_SWIE_LENGTH                                   0x1
#define _PIE0_SWIE_MASK                                     0x1
#define _PIE0_HLVDIE_POSN                                   0x1
#define _PIE0_HLVDIE_POSITION                               0x1
#define _PIE0_HLVDIE_SIZE                                   0x1
#define _PIE0_HLVDIE_LENGTH                                 0x1
#define _PIE0_HLVDIE_MASK                                   0x2
#define _PIE0_OSFIE_POSN                                    0x2
#define _PIE0_OSFIE_POSITION                                0x2
#define _PIE0_OSFIE_SIZE                                    0x1
#define _PIE0_OSFIE_LENGTH                                  0x1
#define _PIE0_OSFIE_MASK                                    0x4
#define _PIE0_CSWIE_POSN                                    0x3
#define _PIE0_CSWIE_POSITION                                0x3
#define _PIE0_CSWIE_SIZE                                    0x1
#define _PIE0_CSWIE_LENGTH                                  0x1
#define _PIE0_CSWIE_MASK                                    0x8
#define _PIE0_NVMIE_POSN                                    0x4
#define _PIE0_NVMIE_POSITION                                0x4
#define _PIE0_NVMIE_SIZE                                    0x1
#define _PIE0_NVMIE_LENGTH                                  0x1
#define _PIE0_NVMIE_MASK                                    0x10
#define _PIE0_SCANIE_POSN                                   0x5
#define _PIE0_SCANIE_POSITION                               0x5
#define _PIE0_SCANIE_SIZE                                   0x1
#define _PIE0_SCANIE_LENGTH                                 0x1
#define _PIE0_SCANIE_MASK                                   0x20
#define _PIE0_CRCIE_POSN                                    0x6
#define _PIE0_CRCIE_POSITION                                0x6
#define _PIE0_CRCIE_SIZE                                    0x1
#define _PIE0_CRCIE_LENGTH                                  0x1
#define _PIE0_CRCIE_MASK                                    0x40
#define _PIE0_IOCIE_POSN                                    0x7
#define _PIE0_IOCIE_POSITION                                0x7
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x80

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x3991);
#ifndef _LIB_BUILD
asm("PIE1 equ 03991h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned ZCDIE                  :1;
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned C1IE                   :1;
        unsigned SMT1IE                 :1;
        unsigned SMT1PRAIE              :1;
        unsigned SMT1PWAIE              :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x3991);
// bitfield macros
#define _PIE1_INT0IE_POSN                                   0x0
#define _PIE1_INT0IE_POSITION                               0x0
#define _PIE1_INT0IE_SIZE                                   0x1
#define _PIE1_INT0IE_LENGTH                                 0x1
#define _PIE1_INT0IE_MASK                                   0x1
#define _PIE1_ZCDIE_POSN                                    0x1
#define _PIE1_ZCDIE_POSITION                                0x1
#define _PIE1_ZCDIE_SIZE                                    0x1
#define _PIE1_ZCDIE_LENGTH                                  0x1
#define _PIE1_ZCDIE_MASK                                    0x2
#define _PIE1_ADIE_POSN                                     0x2
#define _PIE1_ADIE_POSITION                                 0x2
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x4
#define _PIE1_ADTIE_POSN                                    0x3
#define _PIE1_ADTIE_POSITION                                0x3
#define _PIE1_ADTIE_SIZE                                    0x1
#define _PIE1_ADTIE_LENGTH                                  0x1
#define _PIE1_ADTIE_MASK                                    0x8
#define _PIE1_C1IE_POSN                                     0x4
#define _PIE1_C1IE_POSITION                                 0x4
#define _PIE1_C1IE_SIZE                                     0x1
#define _PIE1_C1IE_LENGTH                                   0x1
#define _PIE1_C1IE_MASK                                     0x10
#define _PIE1_SMT1IE_POSN                                   0x5
#define _PIE1_SMT1IE_POSITION                               0x5
#define _PIE1_SMT1IE_SIZE                                   0x1
#define _PIE1_SMT1IE_LENGTH                                 0x1
#define _PIE1_SMT1IE_MASK                                   0x20
#define _PIE1_SMT1PRAIE_POSN                                0x6
#define _PIE1_SMT1PRAIE_POSITION                            0x6
#define _PIE1_SMT1PRAIE_SIZE                                0x1
#define _PIE1_SMT1PRAIE_LENGTH                              0x1
#define _PIE1_SMT1PRAIE_MASK                                0x40
#define _PIE1_SMT1PWAIE_POSN                                0x7
#define _PIE1_SMT1PWAIE_POSITION                            0x7
#define _PIE1_SMT1PWAIE_SIZE                                0x1
#define _PIE1_SMT1PWAIE_LENGTH                              0x1
#define _PIE1_SMT1PWAIE_MASK                                0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x3992);
#ifndef _LIB_BUILD
asm("PIE2 equ 03992h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1SCNTIE             :1;
        unsigned DMA1DCNTIE             :1;
        unsigned DMA1ORIE               :1;
        unsigned DMA1AIE                :1;
        unsigned SPI1RXIE               :1;
        unsigned SPI1TXIE               :1;
        unsigned SPI1IE                 :1;
        unsigned I2C1RXIE               :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x3992);
// bitfield macros
#define _PIE2_DMA1SCNTIE_POSN                               0x0
#define _PIE2_DMA1SCNTIE_POSITION                           0x0
#define _PIE2_DMA1SCNTIE_SIZE                               0x1
#define _PIE2_DMA1SCNTIE_LENGTH                             0x1
#define _PIE2_DMA1SCNTIE_MASK                               0x1
#define _PIE2_DMA1DCNTIE_POSN                               0x1
#define _PIE2_DMA1DCNTIE_POSITION                           0x1
#define _PIE2_DMA1DCNTIE_SIZE                               0x1
#define _PIE2_DMA1DCNTIE_LENGTH                             0x1
#define _PIE2_DMA1DCNTIE_MASK                               0x2
#define _PIE2_DMA1ORIE_POSN                                 0x2
#define _PIE2_DMA1ORIE_POSITION                             0x2
#define _PIE2_DMA1ORIE_SIZE                                 0x1
#define _PIE2_DMA1ORIE_LENGTH                               0x1
#define _PIE2_DMA1ORIE_MASK                                 0x4
#define _PIE2_DMA1AIE_POSN                                  0x3
#define _PIE2_DMA1AIE_POSITION                              0x3
#define _PIE2_DMA1AIE_SIZE                                  0x1
#define _PIE2_DMA1AIE_LENGTH                                0x1
#define _PIE2_DMA1AIE_MASK                                  0x8
#define _PIE2_SPI1RXIE_POSN                                 0x4
#define _PIE2_SPI1RXIE_POSITION                             0x4
#define _PIE2_SPI1RXIE_SIZE                                 0x1
#define _PIE2_SPI1RXIE_LENGTH                               0x1
#define _PIE2_SPI1RXIE_MASK                                 0x10
#define _PIE2_SPI1TXIE_POSN                                 0x5
#define _PIE2_SPI1TXIE_POSITION                             0x5
#define _PIE2_SPI1TXIE_SIZE                                 0x1
#define _PIE2_SPI1TXIE_LENGTH                               0x1
#define _PIE2_SPI1TXIE_MASK                                 0x20
#define _PIE2_SPI1IE_POSN                                   0x6
#define _PIE2_SPI1IE_POSITION                               0x6
#define _PIE2_SPI1IE_SIZE                                   0x1
#define _PIE2_SPI1IE_LENGTH                                 0x1
#define _PIE2_SPI1IE_MASK                                   0x40
#define _PIE2_I2C1RXIE_POSN                                 0x7
#define _PIE2_I2C1RXIE_POSITION                             0x7
#define _PIE2_I2C1RXIE_SIZE                                 0x1
#define _PIE2_I2C1RXIE_LENGTH                               0x1
#define _PIE2_I2C1RXIE_MASK                                 0x80

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x3993);
#ifndef _LIB_BUILD
asm("PIE3 equ 03993h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1TXIE               :1;
        unsigned I2C1IE                 :1;
        unsigned I2C1EIE                :1;
        unsigned U1RXIE                 :1;
        unsigned U1TXIE                 :1;
        unsigned U1EIE                  :1;
        unsigned U1IE                   :1;
        unsigned TMR0IE                 :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0x3993);
// bitfield macros
#define _PIE3_I2C1TXIE_POSN                                 0x0
#define _PIE3_I2C1TXIE_POSITION                             0x0
#define _PIE3_I2C1TXIE_SIZE                                 0x1
#define _PIE3_I2C1TXIE_LENGTH                               0x1
#define _PIE3_I2C1TXIE_MASK                                 0x1
#define _PIE3_I2C1IE_POSN                                   0x1
#define _PIE3_I2C1IE_POSITION                               0x1
#define _PIE3_I2C1IE_SIZE                                   0x1
#define _PIE3_I2C1IE_LENGTH                                 0x1
#define _PIE3_I2C1IE_MASK                                   0x2
#define _PIE3_I2C1EIE_POSN                                  0x2
#define _PIE3_I2C1EIE_POSITION                              0x2
#define _PIE3_I2C1EIE_SIZE                                  0x1
#define _PIE3_I2C1EIE_LENGTH                                0x1
#define _PIE3_I2C1EIE_MASK                                  0x4
#define _PIE3_U1RXIE_POSN                                   0x3
#define _PIE3_U1RXIE_POSITION                               0x3
#define _PIE3_U1RXIE_SIZE                                   0x1
#define _PIE3_U1RXIE_LENGTH                                 0x1
#define _PIE3_U1RXIE_MASK                                   0x8
#define _PIE3_U1TXIE_POSN                                   0x4
#define _PIE3_U1TXIE_POSITION                               0x4
#define _PIE3_U1TXIE_SIZE                                   0x1
#define _PIE3_U1TXIE_LENGTH                                 0x1
#define _PIE3_U1TXIE_MASK                                   0x10
#define _PIE3_U1EIE_POSN                                    0x5
#define _PIE3_U1EIE_POSITION                                0x5
#define _PIE3_U1EIE_SIZE                                    0x1
#define _PIE3_U1EIE_LENGTH                                  0x1
#define _PIE3_U1EIE_MASK                                    0x20
#define _PIE3_U1IE_POSN                                     0x6
#define _PIE3_U1IE_POSITION                                 0x6
#define _PIE3_U1IE_SIZE                                     0x1
#define _PIE3_U1IE_LENGTH                                   0x1
#define _PIE3_U1IE_MASK                                     0x40
#define _PIE3_TMR0IE_POSN                                   0x7
#define _PIE3_TMR0IE_POSITION                               0x7
#define _PIE3_TMR0IE_SIZE                                   0x1
#define _PIE3_TMR0IE_LENGTH                                 0x1
#define _PIE3_TMR0IE_MASK                                   0x80

