MikroElektronika/core_packages/PIC/XC8/def/PIC18F55K42/mcu.h
// Register: T2INPPS
#define T2INPPS T2INPPS
extern volatile unsigned char           T2INPPS             __at(0x3ACA);
#ifndef _LIB_BUILD
asm("T2INPPS equ 03ACAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2INPPS                :6;
    };
} T2INPPSbits_t;
extern volatile T2INPPSbits_t T2INPPSbits __at(0x3ACA);
// bitfield macros
#define _T2INPPS_T2INPPS_POSN                               0x0
#define _T2INPPS_T2INPPS_POSITION                           0x0
#define _T2INPPS_T2INPPS_SIZE                               0x6
#define _T2INPPS_T2INPPS_LENGTH                             0x6
#define _T2INPPS_T2INPPS_MASK                               0x3F

// Register: T4INPPS
#define T4INPPS T4INPPS
extern volatile unsigned char           T4INPPS             __at(0x3ACB);
#ifndef _LIB_BUILD
asm("T4INPPS equ 03ACBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T4INPPS                :6;
    };
} T4INPPSbits_t;
extern volatile T4INPPSbits_t T4INPPSbits __at(0x3ACB);
// bitfield macros
#define _T4INPPS_T4INPPS_POSN                               0x0
#define _T4INPPS_T4INPPS_POSITION                           0x0
#define _T4INPPS_T4INPPS_SIZE                               0x6
#define _T4INPPS_T4INPPS_LENGTH                             0x6
#define _T4INPPS_T4INPPS_MASK                               0x3F

// Register: T6INPPS
#define T6INPPS T6INPPS
extern volatile unsigned char           T6INPPS             __at(0x3ACC);
#ifndef _LIB_BUILD
asm("T6INPPS equ 03ACCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T6INPPS                :6;
    };
} T6INPPSbits_t;
extern volatile T6INPPSbits_t T6INPPSbits __at(0x3ACC);
// bitfield macros
#define _T6INPPS_T6INPPS_POSN                               0x0
#define _T6INPPS_T6INPPS_POSITION                           0x0
#define _T6INPPS_T6INPPS_SIZE                               0x6
#define _T6INPPS_T6INPPS_LENGTH                             0x6
#define _T6INPPS_T6INPPS_MASK                               0x3F

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
extern volatile unsigned char           CCP1PPS             __at(0x3ACD);
#ifndef _LIB_BUILD
asm("CCP1PPS equ 03ACDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1PPS                :6;
    };
} CCP1PPSbits_t;
extern volatile CCP1PPSbits_t CCP1PPSbits __at(0x3ACD);
// bitfield macros
#define _CCP1PPS_CCP1PPS_POSN                               0x0
#define _CCP1PPS_CCP1PPS_POSITION                           0x0
#define _CCP1PPS_CCP1PPS_SIZE                               0x6
#define _CCP1PPS_CCP1PPS_LENGTH                             0x6
#define _CCP1PPS_CCP1PPS_MASK                               0x3F

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
extern volatile unsigned char           CCP2PPS             __at(0x3ACE);
#ifndef _LIB_BUILD
asm("CCP2PPS equ 03ACEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2PPS                :6;
    };
} CCP2PPSbits_t;
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x3ACE);
// bitfield macros
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x6
#define _CCP2PPS_CCP2PPS_LENGTH                             0x6
#define _CCP2PPS_CCP2PPS_MASK                               0x3F

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
extern volatile unsigned char           CCP3PPS             __at(0x3ACF);
#ifndef _LIB_BUILD
asm("CCP3PPS equ 03ACFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3PPS                :6;
    };
} CCP3PPSbits_t;
extern volatile CCP3PPSbits_t CCP3PPSbits __at(0x3ACF);
// bitfield macros
#define _CCP3PPS_CCP3PPS_POSN                               0x0
#define _CCP3PPS_CCP3PPS_POSITION                           0x0
#define _CCP3PPS_CCP3PPS_SIZE                               0x6
#define _CCP3PPS_CCP3PPS_LENGTH                             0x6
#define _CCP3PPS_CCP3PPS_MASK                               0x3F

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
extern volatile unsigned char           CCP4PPS             __at(0x3AD0);
#ifndef _LIB_BUILD
asm("CCP4PPS equ 03AD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4PPS                :6;
    };
} CCP4PPSbits_t;
extern volatile CCP4PPSbits_t CCP4PPSbits __at(0x3AD0);
// bitfield macros
#define _CCP4PPS_CCP4PPS_POSN                               0x0
#define _CCP4PPS_CCP4PPS_POSITION                           0x0
#define _CCP4PPS_CCP4PPS_SIZE                               0x6
#define _CCP4PPS_CCP4PPS_LENGTH                             0x6
#define _CCP4PPS_CCP4PPS_MASK                               0x3F

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
extern volatile unsigned char           SMT1WINPPS          __at(0x3AD1);
#ifndef _LIB_BUILD
asm("SMT1WINPPS equ 03AD1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1WINPPS             :6;
    };
} SMT1WINPPSbits_t;
extern volatile SMT1WINPPSbits_t SMT1WINPPSbits __at(0x3AD1);
// bitfield macros
#define _SMT1WINPPS_SMT1WINPPS_POSN                         0x0
#define _SMT1WINPPS_SMT1WINPPS_POSITION                     0x0
#define _SMT1WINPPS_SMT1WINPPS_SIZE                         0x6
#define _SMT1WINPPS_SMT1WINPPS_LENGTH                       0x6
#define _SMT1WINPPS_SMT1WINPPS_MASK                         0x3F

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
extern volatile unsigned char           SMT1SIGPPS          __at(0x3AD2);
#ifndef _LIB_BUILD
asm("SMT1SIGPPS equ 03AD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1SIGPPS             :6;
    };
} SMT1SIGPPSbits_t;
extern volatile SMT1SIGPPSbits_t SMT1SIGPPSbits __at(0x3AD2);
// bitfield macros
#define _SMT1SIGPPS_SMT1SIGPPS_POSN                         0x0
#define _SMT1SIGPPS_SMT1SIGPPS_POSITION                     0x0
#define _SMT1SIGPPS_SMT1SIGPPS_SIZE                         0x6
#define _SMT1SIGPPS_SMT1SIGPPS_LENGTH                       0x6
#define _SMT1SIGPPS_SMT1SIGPPS_MASK                         0x3F

// Register: CWG1INPPS
#define CWG1INPPS CWG1INPPS
extern volatile unsigned char           CWG1INPPS           __at(0x3AD3);
#ifndef _LIB_BUILD
asm("CWG1INPPS equ 03AD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1INPPS              :6;
    };
} CWG1INPPSbits_t;
extern volatile CWG1INPPSbits_t CWG1INPPSbits __at(0x3AD3);
// bitfield macros
#define _CWG1INPPS_CWG1INPPS_POSN                           0x0
#define _CWG1INPPS_CWG1INPPS_POSITION                       0x0
#define _CWG1INPPS_CWG1INPPS_SIZE                           0x6
#define _CWG1INPPS_CWG1INPPS_LENGTH                         0x6
#define _CWG1INPPS_CWG1INPPS_MASK                           0x3F

// Register: CWG2INPPS
#define CWG2INPPS CWG2INPPS
extern volatile unsigned char           CWG2INPPS           __at(0x3AD4);
#ifndef _LIB_BUILD
asm("CWG2INPPS equ 03AD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG2INPPS              :6;
    };
} CWG2INPPSbits_t;
