MikroElektronika/core_packages/PIC/XC8/def/PIC18F55K42/mcu.h
extern volatile DMA2DCNTHbits_t DMA2DCNTHbits __at(0x3BCB);
// bitfield macros
#define _DMA2DCNTH_DCNT_POSN                                0x0
#define _DMA2DCNTH_DCNT_POSITION                            0x0
#define _DMA2DCNTH_DCNT_SIZE                                0x4
#define _DMA2DCNTH_DCNT_LENGTH                              0x4
#define _DMA2DCNTH_DCNT_MASK                                0xF
#define _DMA2DCNTH_DCNT8_POSN                               0x0
#define _DMA2DCNTH_DCNT8_POSITION                           0x0
#define _DMA2DCNTH_DCNT8_SIZE                               0x1
#define _DMA2DCNTH_DCNT8_LENGTH                             0x1
#define _DMA2DCNTH_DCNT8_MASK                               0x1
#define _DMA2DCNTH_DCNT9_POSN                               0x1
#define _DMA2DCNTH_DCNT9_POSITION                           0x1
#define _DMA2DCNTH_DCNT9_SIZE                               0x1
#define _DMA2DCNTH_DCNT9_LENGTH                             0x1
#define _DMA2DCNTH_DCNT9_MASK                               0x2
#define _DMA2DCNTH_DCNT10_POSN                              0x2
#define _DMA2DCNTH_DCNT10_POSITION                          0x2
#define _DMA2DCNTH_DCNT10_SIZE                              0x1
#define _DMA2DCNTH_DCNT10_LENGTH                            0x1
#define _DMA2DCNTH_DCNT10_MASK                              0x4
#define _DMA2DCNTH_DCNT11_POSN                              0x3
#define _DMA2DCNTH_DCNT11_POSITION                          0x3
#define _DMA2DCNTH_DCNT11_SIZE                              0x1
#define _DMA2DCNTH_DCNT11_LENGTH                            0x1
#define _DMA2DCNTH_DCNT11_MASK                              0x8
#define _DMA2DCNTH_DMA2SCNT_POSN                            0x0
#define _DMA2DCNTH_DMA2SCNT_POSITION                        0x0
#define _DMA2DCNTH_DMA2SCNT_SIZE                            0x4
#define _DMA2DCNTH_DMA2SCNT_LENGTH                          0x4
#define _DMA2DCNTH_DMA2SCNT_MASK                            0xF
#define _DMA2DCNTH_DMA2DCNT8_POSN                           0x0
#define _DMA2DCNTH_DMA2DCNT8_POSITION                       0x0
#define _DMA2DCNTH_DMA2DCNT8_SIZE                           0x1
#define _DMA2DCNTH_DMA2DCNT8_LENGTH                         0x1
#define _DMA2DCNTH_DMA2DCNT8_MASK                           0x1
#define _DMA2DCNTH_DMA2DCNT9_POSN                           0x1
#define _DMA2DCNTH_DMA2DCNT9_POSITION                       0x1
#define _DMA2DCNTH_DMA2DCNT9_SIZE                           0x1
#define _DMA2DCNTH_DMA2DCNT9_LENGTH                         0x1
#define _DMA2DCNTH_DMA2DCNT9_MASK                           0x2
#define _DMA2DCNTH_DMA2DCNT10_POSN                          0x2
#define _DMA2DCNTH_DMA2DCNT10_POSITION                      0x2
#define _DMA2DCNTH_DMA2DCNT10_SIZE                          0x1
#define _DMA2DCNTH_DMA2DCNT10_LENGTH                        0x1
#define _DMA2DCNTH_DMA2DCNT10_MASK                          0x4
#define _DMA2DCNTH_DMA2DCNT11_POSN                          0x3
#define _DMA2DCNTH_DMA2DCNT11_POSITION                      0x3
#define _DMA2DCNTH_DMA2DCNT11_SIZE                          0x1
#define _DMA2DCNTH_DMA2DCNT11_LENGTH                        0x1
#define _DMA2DCNTH_DMA2DCNT11_MASK                          0x8

// Register: DMA2DPTR
#define DMA2DPTR DMA2DPTR
extern volatile unsigned short          DMA2DPTR            __at(0x3BCC);
#ifndef _LIB_BUILD
asm("DMA2DPTR equ 03BCCh");
#endif

// Register: DMA2DPTRL
#define DMA2DPTRL DMA2DPTRL
extern volatile unsigned char           DMA2DPTRL           __at(0x3BCC);
#ifndef _LIB_BUILD
asm("DMA2DPTRL equ 03BCCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR0                  :1;
        unsigned DPTR1                  :1;
        unsigned DPTR2                  :1;
        unsigned DPTR3                  :1;
        unsigned DPTR4                  :1;
        unsigned DPTR5                  :1;
        unsigned DPTR6                  :1;
        unsigned DPTR7                  :1;
    };
    struct {
        unsigned DMA2DPTR               :8;
    };
    struct {
        unsigned DMA2DPTR0              :1;
        unsigned DMA2DPTR1              :1;
        unsigned DMA2DPTR2              :1;
        unsigned DMA2DPTR3              :1;
        unsigned DMA2DPTR4              :1;
        unsigned DMA2DPTR5              :1;
        unsigned DMA2DPTR6              :1;
        unsigned DMA2DPTR7              :1;
    };
} DMA2DPTRLbits_t;
extern volatile DMA2DPTRLbits_t DMA2DPTRLbits __at(0x3BCC);
// bitfield macros
#define _DMA2DPTRL_DPTR_POSN                                0x0
#define _DMA2DPTRL_DPTR_POSITION                            0x0
#define _DMA2DPTRL_DPTR_SIZE                                0x8
#define _DMA2DPTRL_DPTR_LENGTH                              0x8
#define _DMA2DPTRL_DPTR_MASK                                0xFF
#define _DMA2DPTRL_DPTR0_POSN                               0x0
#define _DMA2DPTRL_DPTR0_POSITION                           0x0
#define _DMA2DPTRL_DPTR0_SIZE                               0x1
#define _DMA2DPTRL_DPTR0_LENGTH                             0x1
#define _DMA2DPTRL_DPTR0_MASK                               0x1
#define _DMA2DPTRL_DPTR1_POSN                               0x1
#define _DMA2DPTRL_DPTR1_POSITION                           0x1
#define _DMA2DPTRL_DPTR1_SIZE                               0x1
#define _DMA2DPTRL_DPTR1_LENGTH                             0x1
#define _DMA2DPTRL_DPTR1_MASK                               0x2
#define _DMA2DPTRL_DPTR2_POSN                               0x2
#define _DMA2DPTRL_DPTR2_POSITION                           0x2
#define _DMA2DPTRL_DPTR2_SIZE                               0x1
#define _DMA2DPTRL_DPTR2_LENGTH                             0x1
#define _DMA2DPTRL_DPTR2_MASK                               0x4
#define _DMA2DPTRL_DPTR3_POSN                               0x3
#define _DMA2DPTRL_DPTR3_POSITION                           0x3
#define _DMA2DPTRL_DPTR3_SIZE                               0x1
#define _DMA2DPTRL_DPTR3_LENGTH                             0x1
#define _DMA2DPTRL_DPTR3_MASK                               0x8
#define _DMA2DPTRL_DPTR4_POSN                               0x4
#define _DMA2DPTRL_DPTR4_POSITION                           0x4
#define _DMA2DPTRL_DPTR4_SIZE                               0x1
#define _DMA2DPTRL_DPTR4_LENGTH                             0x1
#define _DMA2DPTRL_DPTR4_MASK                               0x10
#define _DMA2DPTRL_DPTR5_POSN                               0x5
#define _DMA2DPTRL_DPTR5_POSITION                           0x5
#define _DMA2DPTRL_DPTR5_SIZE                               0x1
#define _DMA2DPTRL_DPTR5_LENGTH                             0x1
#define _DMA2DPTRL_DPTR5_MASK                               0x20
#define _DMA2DPTRL_DPTR6_POSN                               0x6
#define _DMA2DPTRL_DPTR6_POSITION                           0x6
#define _DMA2DPTRL_DPTR6_SIZE                               0x1
#define _DMA2DPTRL_DPTR6_LENGTH                             0x1
#define _DMA2DPTRL_DPTR6_MASK                               0x40
#define _DMA2DPTRL_DPTR7_POSN                               0x7
#define _DMA2DPTRL_DPTR7_POSITION                           0x7
#define _DMA2DPTRL_DPTR7_SIZE                               0x1
#define _DMA2DPTRL_DPTR7_LENGTH                             0x1
#define _DMA2DPTRL_DPTR7_MASK                               0x80
#define _DMA2DPTRL_DMA2DPTR_POSN                            0x0
#define _DMA2DPTRL_DMA2DPTR_POSITION                        0x0
#define _DMA2DPTRL_DMA2DPTR_SIZE                            0x8
#define _DMA2DPTRL_DMA2DPTR_LENGTH                          0x8
#define _DMA2DPTRL_DMA2DPTR_MASK                            0xFF
#define _DMA2DPTRL_DMA2DPTR0_POSN                           0x0
#define _DMA2DPTRL_DMA2DPTR0_POSITION                       0x0
#define _DMA2DPTRL_DMA2DPTR0_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR0_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR0_MASK                           0x1
#define _DMA2DPTRL_DMA2DPTR1_POSN                           0x1
#define _DMA2DPTRL_DMA2DPTR1_POSITION                       0x1
#define _DMA2DPTRL_DMA2DPTR1_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR1_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR1_MASK                           0x2
#define _DMA2DPTRL_DMA2DPTR2_POSN                           0x2
#define _DMA2DPTRL_DMA2DPTR2_POSITION                       0x2
#define _DMA2DPTRL_DMA2DPTR2_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR2_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR2_MASK                           0x4
#define _DMA2DPTRL_DMA2DPTR3_POSN                           0x3
#define _DMA2DPTRL_DMA2DPTR3_POSITION                       0x3
#define _DMA2DPTRL_DMA2DPTR3_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR3_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR3_MASK                           0x8
#define _DMA2DPTRL_DMA2DPTR4_POSN                           0x4
#define _DMA2DPTRL_DMA2DPTR4_POSITION                       0x4
#define _DMA2DPTRL_DMA2DPTR4_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR4_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR4_MASK                           0x10
#define _DMA2DPTRL_DMA2DPTR5_POSN                           0x5
#define _DMA2DPTRL_DMA2DPTR5_POSITION                       0x5
#define _DMA2DPTRL_DMA2DPTR5_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR5_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR5_MASK                           0x20
#define _DMA2DPTRL_DMA2DPTR6_POSN                           0x6
#define _DMA2DPTRL_DMA2DPTR6_POSITION                       0x6
#define _DMA2DPTRL_DMA2DPTR6_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR6_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR6_MASK                           0x40
#define _DMA2DPTRL_DMA2DPTR7_POSN                           0x7
#define _DMA2DPTRL_DMA2DPTR7_POSITION                       0x7
#define _DMA2DPTRL_DMA2DPTR7_SIZE                           0x1
#define _DMA2DPTRL_DMA2DPTR7_LENGTH                         0x1
#define _DMA2DPTRL_DMA2DPTR7_MASK                           0x80

