MikroElektronika/core_packages/PIC/XC8/def/PIC18F55K42/mcu.h
extern volatile __bit                   RF4PPS4             __at(0x1D164);	// @ (0x3A2C * 8 + 4)
#define                                 RF4PPS4_bit         _BIT_ACCESS(RF4PPS,4)
// RF4PPS<RF4PPS5>
extern volatile __bit                   RF4PPS5             __at(0x1D165);	// @ (0x3A2C * 8 + 5)
#define                                 RF4PPS5_bit         _BIT_ACCESS(RF4PPS,5)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x1FE7D);	// @ (0x3FCF * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// RF5PPS<RF5PPS0>
extern volatile __bit                   RF5PPS0             __at(0x1D168);	// @ (0x3A2D * 8 + 0)
#define                                 RF5PPS0_bit         _BIT_ACCESS(RF5PPS,0)
// RF5PPS<RF5PPS1>
extern volatile __bit                   RF5PPS1             __at(0x1D169);	// @ (0x3A2D * 8 + 1)
#define                                 RF5PPS1_bit         _BIT_ACCESS(RF5PPS,1)
// RF5PPS<RF5PPS2>
extern volatile __bit                   RF5PPS2             __at(0x1D16A);	// @ (0x3A2D * 8 + 2)
#define                                 RF5PPS2_bit         _BIT_ACCESS(RF5PPS,2)
// RF5PPS<RF5PPS3>
extern volatile __bit                   RF5PPS3             __at(0x1D16B);	// @ (0x3A2D * 8 + 3)
#define                                 RF5PPS3_bit         _BIT_ACCESS(RF5PPS,3)
// RF5PPS<RF5PPS4>
extern volatile __bit                   RF5PPS4             __at(0x1D16C);	// @ (0x3A2D * 8 + 4)
#define                                 RF5PPS4_bit         _BIT_ACCESS(RF5PPS,4)
// RF5PPS<RF5PPS5>
extern volatile __bit                   RF5PPS5             __at(0x1D16D);	// @ (0x3A2D * 8 + 5)
#define                                 RF5PPS5_bit         _BIT_ACCESS(RF5PPS,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x1FE7E);	// @ (0x3FCF * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// RF6PPS<RF6PPS0>
extern volatile __bit                   RF6PPS0             __at(0x1D170);	// @ (0x3A2E * 8 + 0)
#define                                 RF6PPS0_bit         _BIT_ACCESS(RF6PPS,0)
// RF6PPS<RF6PPS1>
extern volatile __bit                   RF6PPS1             __at(0x1D171);	// @ (0x3A2E * 8 + 1)
#define                                 RF6PPS1_bit         _BIT_ACCESS(RF6PPS,1)
// RF6PPS<RF6PPS2>
extern volatile __bit                   RF6PPS2             __at(0x1D172);	// @ (0x3A2E * 8 + 2)
#define                                 RF6PPS2_bit         _BIT_ACCESS(RF6PPS,2)
// RF6PPS<RF6PPS3>
extern volatile __bit                   RF6PPS3             __at(0x1D173);	// @ (0x3A2E * 8 + 3)
#define                                 RF6PPS3_bit         _BIT_ACCESS(RF6PPS,3)
// RF6PPS<RF6PPS4>
extern volatile __bit                   RF6PPS4             __at(0x1D174);	// @ (0x3A2E * 8 + 4)
#define                                 RF6PPS4_bit         _BIT_ACCESS(RF6PPS,4)
// RF6PPS<RF6PPS5>
extern volatile __bit                   RF6PPS5             __at(0x1D175);	// @ (0x3A2E * 8 + 5)
#define                                 RF6PPS5_bit         _BIT_ACCESS(RF6PPS,5)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x1FE7F);	// @ (0x3FCF * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// RF7PPS<RF7PPS0>
extern volatile __bit                   RF7PPS0             __at(0x1D178);	// @ (0x3A2F * 8 + 0)
#define                                 RF7PPS0_bit         _BIT_ACCESS(RF7PPS,0)
// RF7PPS<RF7PPS1>
extern volatile __bit                   RF7PPS1             __at(0x1D179);	// @ (0x3A2F * 8 + 1)
#define                                 RF7PPS1_bit         _BIT_ACCESS(RF7PPS,1)
// RF7PPS<RF7PPS2>
extern volatile __bit                   RF7PPS2             __at(0x1D17A);	// @ (0x3A2F * 8 + 2)
#define                                 RF7PPS2_bit         _BIT_ACCESS(RF7PPS,2)
// RF7PPS<RF7PPS3>
extern volatile __bit                   RF7PPS3             __at(0x1D17B);	// @ (0x3A2F * 8 + 3)
#define                                 RF7PPS3_bit         _BIT_ACCESS(RF7PPS,3)
// RF7PPS<RF7PPS4>
extern volatile __bit                   RF7PPS4             __at(0x1D17C);	// @ (0x3A2F * 8 + 4)
#define                                 RF7PPS4_bit         _BIT_ACCESS(RF7PPS,4)
// RF7PPS<RF7PPS5>
extern volatile __bit                   RF7PPS5             __at(0x1D17D);	// @ (0x3A2F * 8 + 5)
#define                                 RF7PPS5_bit         _BIT_ACCESS(RF7PPS,5)
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 RI_bit              _BIT_ACCESS(PCON0,2)
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 RMCLR_bit           _BIT_ACCESS(PCON0,3)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x1CEC5);	// @ (0x39D8 * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x1F760);	// @ (0x3EEC * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x1F761);	// @ (0x3EEC * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x1F762);	// @ (0x3EEC * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x1F763);	// @ (0x3EEC * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x1F764);	// @ (0x3EEC * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0x1F765);	// @ (0x3EEC * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x1F766);	// @ (0x3EEC * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x1F767);	// @ (0x3EEC * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// I2C1PIE<RSC1IE>
extern volatile __bit                   RSC1IE              __at(0x1EBD1);	// @ (0x3D7A * 8 + 1)
#define                                 RSC1IE_bit          _BIT_ACCESS(I2C1PIE,1)
// I2C1PIR<RSC1IF>
extern volatile __bit                   RSC1IF              __at(0x1EBC9);	// @ (0x3D79 * 8 + 1)
#define                                 RSC1IF_bit          _BIT_ACCESS(I2C1PIR,1)
// I2C2PIE<RSC2IE>
extern volatile __bit                   RSC2IE              __at(0x1EB21);	// @ (0x3D64 * 8 + 1)
#define                                 RSC2IE_bit          _BIT_ACCESS(I2C2PIE,1)
// I2C2PIR<RSC2IF>
extern volatile __bit                   RSC2IF              __at(0x1EB19);	// @ (0x3D63 * 8 + 1)
#define                                 RSC2IF_bit          _BIT_ACCESS(I2C2PIR,1)
// SMT1STAT<RST>
extern volatile __bit                   RST                 __at(0x1F905);	// @ (0x3F20 * 8 + 5)
#define                                 RST_bit             _BIT_ACCESS(SMT1STAT,5)
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 RWDT_bit            _BIT_ACCESS(PCON0,4)
// SPI1RXB<RXB0>
extern volatile __bit                   RXB0                __at(0x1E880);	// @ (0x3D10 * 8 + 0)
#define                                 RXB0_bit            _BIT_ACCESS(SPI1RXB,0)
// SPI1RXB<RXB1>
extern volatile __bit                   RXB1                __at(0x1E881);	// @ (0x3D10 * 8 + 1)
#define                                 RXB1_bit            _BIT_ACCESS(SPI1RXB,1)
// SPI1RXB<RXB2>
extern volatile __bit                   RXB2                __at(0x1E882);	// @ (0x3D10 * 8 + 2)
#define                                 RXB2_bit            _BIT_ACCESS(SPI1RXB,2)
// SPI1RXB<RXB3>
extern volatile __bit                   RXB3                __at(0x1E883);	// @ (0x3D10 * 8 + 3)
#define                                 RXB3_bit            _BIT_ACCESS(SPI1RXB,3)
// SPI1RXB<RXB4>
extern volatile __bit                   RXB4                __at(0x1E884);	// @ (0x3D10 * 8 + 4)
#define                                 RXB4_bit            _BIT_ACCESS(SPI1RXB,4)
// SPI1RXB<RXB5>
extern volatile __bit                   RXB5                __at(0x1E885);	// @ (0x3D10 * 8 + 5)
#define                                 RXB5_bit            _BIT_ACCESS(SPI1RXB,5)
// SPI1RXB<RXB6>
extern volatile __bit                   RXB6                __at(0x1E886);	// @ (0x3D10 * 8 + 6)
#define                                 RXB6_bit            _BIT_ACCESS(SPI1RXB,6)
// SPI1RXB<RXB7>
extern volatile __bit                   RXB7                __at(0x1E887);	// @ (0x3D10 * 8 + 7)
#define                                 RXB7_bit            _BIT_ACCESS(SPI1RXB,7)
// SPI1INTE<RXOIE>
extern volatile __bit                   RXOIE               __at(0x1E8DA);	// @ (0x3D1B * 8 + 2)
#define                                 RXOIE_bit           _BIT_ACCESS(SPI1INTE,2)
// SPI1INTF<RXOIF>
extern volatile __bit                   RXOIF               __at(0x1E8D2);	// @ (0x3D1A * 8 + 2)
#define                                 RXOIF_bit           _BIT_ACCESS(SPI1INTF,2)
// SPI1CON2<RXR>
extern volatile __bit                   RXR                 __at(0x1E8B0);	// @ (0x3D16 * 8 + 0)
#define                                 RXR_bit             _BIT_ACCESS(SPI1CON2,0)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x1CE87);	// @ (0x39D0 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// I2C1PIE<SC1IE>
extern volatile __bit                   SC1IE               __at(0x1EBD0);	// @ (0x3D7A * 8 + 0)
#define                                 SC1IE_bit           _BIT_ACCESS(I2C1PIE,0)
// I2C1PIR<SC1IF>
extern volatile __bit                   SC1IF               __at(0x1EBC8);	// @ (0x3D79 * 8 + 0)
#define                                 SC1IF_bit           _BIT_ACCESS(I2C1PIR,0)
// I2C2PIE<SC2IE>
extern volatile __bit                   SC2IE               __at(0x1EB20);	// @ (0x3D64 * 8 + 0)
#define                                 SC2IE_bit           _BIT_ACCESS(I2C2PIE,0)
// I2C2PIR<SC2IF>
extern volatile __bit                   SC2IF               __at(0x1EB18);	// @ (0x3D63 * 8 + 0)
#define                                 SC2IF_bit           _BIT_ACCESS(I2C2PIR,0)
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x1CBC8);	// @ (0x3979 * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x1CBC9);	// @ (0x3979 * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x1CBD2);	// @ (0x397A * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x1CBD3);	// @ (0x397A * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x1CBD4);	// @ (0x397A * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x1CBD5);	// @ (0x397A * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x1CBD6);	// @ (0x397A * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x1CBD7);	// @ (0x397A * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x1CBD8);	// @ (0x397B * 8 + 0)
#define                                 SCANHADR16_bit      _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x1CBD9);	// @ (0x397B * 8 + 1)
#define                                 SCANHADR17_bit      _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<SCANHADR18>
extern volatile __bit                   SCANHADR18          __at(0x1CBDA);	// @ (0x397B * 8 + 2)
#define                                 SCANHADR18_bit      _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<SCANHADR19>
extern volatile __bit                   SCANHADR19          __at(0x1CBDB);	// @ (0x397B * 8 + 3)
#define                                 SCANHADR19_bit      _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x1CBCA);	// @ (0x3979 * 8 + 2)
#define                                 SCANHADR2_bit       _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<SCANHADR20>
extern volatile __bit                   SCANHADR20          __at(0x1CBDC);	// @ (0x397B * 8 + 4)
#define                                 SCANHADR20_bit      _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<SCANHADR21>
extern volatile __bit                   SCANHADR21          __at(0x1CBDD);	// @ (0x397B * 8 + 5)
#define                                 SCANHADR21_bit      _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x1CBCB);	// @ (0x3979 * 8 + 3)
#define                                 SCANHADR3_bit       _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x1CBCC);	// @ (0x3979 * 8 + 4)
#define                                 SCANHADR4_bit       _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x1CBCD);	// @ (0x3979 * 8 + 5)
#define                                 SCANHADR5_bit       _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x1CBCE);	// @ (0x3979 * 8 + 6)
#define                                 SCANHADR6_bit       _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x1CBCF);	// @ (0x3979 * 8 + 7)
#define                                 SCANHADR7_bit       _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x1CBD0);	// @ (0x397A * 8 + 0)
#define                                 SCANHADR8_bit       _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x1CBD1);	// @ (0x397A * 8 + 1)
#define                                 SCANHADR9_bit       _BIT_ACCESS(SCANHADRH,1)
// PIE0<SCANIE>
extern volatile __bit                   SCANIE              __at(0x1CC85);	// @ (0x3990 * 8 + 5)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE0,5)
// PIR0<SCANIF>
extern volatile __bit                   SCANIF              __at(0x1CD05);	// @ (0x39A0 * 8 + 5)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR0,5)
// IPR0<SCANIP>
extern volatile __bit                   SCANIP              __at(0x1CC05);	// @ (0x3980 * 8 + 5)
#define                                 SCANIP_bit          _BIT_ACCESS(IPR0,5)
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x1CBB0);	// @ (0x3976 * 8 + 0)
#define                                 SCANLADR0_bit       _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x1CBB1);	// @ (0x3976 * 8 + 1)
#define                                 SCANLADR1_bit       _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x1CBBA);	// @ (0x3977 * 8 + 2)
#define                                 SCANLADR10_bit      _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x1CBBB);	// @ (0x3977 * 8 + 3)
#define                                 SCANLADR11_bit      _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<SCANLADR12>
extern volatile __bit                   SCANLADR12          __at(0x1CBBC);	// @ (0x3977 * 8 + 4)
#define                                 SCANLADR12_bit      _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<SCANLADR13>
extern volatile __bit                   SCANLADR13          __at(0x1CBBD);	// @ (0x3977 * 8 + 5)
#define                                 SCANLADR13_bit      _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<SCANLADR14>
extern volatile __bit                   SCANLADR14          __at(0x1CBBE);	// @ (0x3977 * 8 + 6)
#define                                 SCANLADR14_bit      _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<SCANLADR15>
extern volatile __bit                   SCANLADR15          __at(0x1CBBF);	// @ (0x3977 * 8 + 7)
#define                                 SCANLADR15_bit      _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<SCANLADR16>
extern volatile __bit                   SCANLADR16          __at(0x1CBC0);	// @ (0x3978 * 8 + 0)
#define                                 SCANLADR16_bit      _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<SCANLADR17>
extern volatile __bit                   SCANLADR17          __at(0x1CBC1);	// @ (0x3978 * 8 + 1)
#define                                 SCANLADR17_bit      _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<SCANLADR18>
extern volatile __bit                   SCANLADR18          __at(0x1CBC2);	// @ (0x3978 * 8 + 2)
#define                                 SCANLADR18_bit      _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<SCANLADR19>
extern volatile __bit                   SCANLADR19          __at(0x1CBC3);	// @ (0x3978 * 8 + 3)
#define                                 SCANLADR19_bit      _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<SCANLADR2>
extern volatile __bit                   SCANLADR2           __at(0x1CBB2);	// @ (0x3976 * 8 + 2)
#define                                 SCANLADR2_bit       _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<SCANLADR20>
extern volatile __bit                   SCANLADR20          __at(0x1CBC4);	// @ (0x3978 * 8 + 4)
#define                                 SCANLADR20_bit      _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<SCANLADR21>
extern volatile __bit                   SCANLADR21          __at(0x1CBC5);	// @ (0x3978 * 8 + 5)
#define                                 SCANLADR21_bit      _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<SCANLADR3>
extern volatile __bit                   SCANLADR3           __at(0x1CBB3);	// @ (0x3976 * 8 + 3)
#define                                 SCANLADR3_bit       _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<SCANLADR4>
extern volatile __bit                   SCANLADR4           __at(0x1CBB4);	// @ (0x3976 * 8 + 4)
#define                                 SCANLADR4_bit       _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<SCANLADR5>
extern volatile __bit                   SCANLADR5           __at(0x1CBB5);	// @ (0x3976 * 8 + 5)
#define                                 SCANLADR5_bit       _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<SCANLADR6>
extern volatile __bit                   SCANLADR6           __at(0x1CBB6);	// @ (0x3976 * 8 + 6)
#define                                 SCANLADR6_bit       _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<SCANLADR7>
extern volatile __bit                   SCANLADR7           __at(0x1CBB7);	// @ (0x3976 * 8 + 7)
#define                                 SCANLADR7_bit       _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<SCANLADR8>
extern volatile __bit                   SCANLADR8           __at(0x1CBB8);	// @ (0x3977 * 8 + 0)
#define                                 SCANLADR8_bit       _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<SCANLADR9>
extern volatile __bit                   SCANLADR9           __at(0x1CBB9);	// @ (0x3977 * 8 + 1)
#define                                 SCANLADR9_bit       _BIT_ACCESS(SCANLADRH,1)
// PMD0<SCANMD>
extern volatile __bit                   SCANMD              __at(0x1CE03);	// @ (0x39C0 * 8 + 3)
#define                                 SCANMD_bit          _BIT_ACCESS(PMD0,3)
// SCANPR<SCANPR0>
extern volatile __bit                   SCANPR0             __at(0x1CFB8);	// @ (0x39F7 * 8 + 0)
#define                                 SCANPR0_bit         _BIT_ACCESS(SCANPR,0)
// SCANPR<SCANPR1>
extern volatile __bit                   SCANPR1             __at(0x1CFB9);	// @ (0x39F7 * 8 + 1)
#define                                 SCANPR1_bit         _BIT_ACCESS(SCANPR,1)
// SCANPR<SCANPR2>
extern volatile __bit                   SCANPR2             __at(0x1CFBA);	// @ (0x39F7 * 8 + 2)
#define                                 SCANPR2_bit         _BIT_ACCESS(SCANPR,2)
// SPI1CON1<SDIP>
extern volatile __bit                   SDIP                __at(0x1E8A9);	// @ (0x3D15 * 8 + 1)
#define                                 SDIP_bit            _BIT_ACCESS(SPI1CON1,1)
// SPI1CON1<SDOP>
extern volatile __bit                   SDOP                __at(0x1E8A8);	// @ (0x3D15 * 8 + 0)
#define                                 SDOP_bit            _BIT_ACCESS(SPI1CON1,0)
// HLVDCON1<SEL2>
extern volatile __bit                   SEL2                __at(0x1F652);	// @ (0x3ECA * 8 + 2)
#define                                 SEL2_bit            _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<SEL3>
extern volatile __bit                   SEL3                __at(0x1F653);	// @ (0x3ECA * 8 + 3)
#define                                 SEL3_bit            _BIT_ACCESS(HLVDCON1,3)
// SCANCON0<SGO>
extern volatile __bit                   SGO                 __at(0x1CBE5);	// @ (0x397C * 8 + 5)
#define                                 SGO_bit             _BIT_ACCESS(SCANCON0,5)
// SHADCON<SHADLO>
extern volatile __bit                   SHADLO              __at(0x1C418);	// @ (0x3883 * 8 + 0)
#define                                 SHADLO_bit          _BIT_ACCESS(SHADCON,0)
// CRCSHIFTL<SHFT0>
extern volatile __bit                   SHFT0               __at(0x1CB20);	// @ (0x3964 * 8 + 0)
#define                                 SHFT0_bit           _BIT_ACCESS(CRCSHIFTL,0)
// CRCSHIFTL<SHFT1>
extern volatile __bit                   SHFT1               __at(0x1CB21);	// @ (0x3964 * 8 + 1)
#define                                 SHFT1_bit           _BIT_ACCESS(CRCSHIFTL,1)
// CRCSHIFTH<SHFT10>
extern volatile __bit                   SHFT10              __at(0x1CB2A);	// @ (0x3965 * 8 + 2)
#define                                 SHFT10_bit          _BIT_ACCESS(CRCSHIFTH,2)
// CRCSHIFTH<SHFT11>
extern volatile __bit                   SHFT11              __at(0x1CB2B);	// @ (0x3965 * 8 + 3)
#define                                 SHFT11_bit          _BIT_ACCESS(CRCSHIFTH,3)
// CRCSHIFTH<SHFT12>
extern volatile __bit                   SHFT12              __at(0x1CB2C);	// @ (0x3965 * 8 + 4)
#define                                 SHFT12_bit          _BIT_ACCESS(CRCSHIFTH,4)
// CRCSHIFTH<SHFT13>
extern volatile __bit                   SHFT13              __at(0x1CB2D);	// @ (0x3965 * 8 + 5)
#define                                 SHFT13_bit          _BIT_ACCESS(CRCSHIFTH,5)
// CRCSHIFTH<SHFT14>
extern volatile __bit                   SHFT14              __at(0x1CB2E);	// @ (0x3965 * 8 + 6)
