MikroElektronika/core_packages/PIC/XC8/def/PIC18F55K42/mcu.h
// SMT1PRH<SMT1PR12>
extern volatile __bit                   SMT1PR12            __at(0x1F8E4);	// @ (0x3F1C * 8 + 4)
#define                                 SMT1PR12_bit        _BIT_ACCESS(SMT1PRH,4)
// SMT1PRH<SMT1PR13>
extern volatile __bit                   SMT1PR13            __at(0x1F8E5);	// @ (0x3F1C * 8 + 5)
#define                                 SMT1PR13_bit        _BIT_ACCESS(SMT1PRH,5)
// SMT1PRH<SMT1PR14>
extern volatile __bit                   SMT1PR14            __at(0x1F8E6);	// @ (0x3F1C * 8 + 6)
#define                                 SMT1PR14_bit        _BIT_ACCESS(SMT1PRH,6)
// SMT1PRH<SMT1PR15>
extern volatile __bit                   SMT1PR15            __at(0x1F8E7);	// @ (0x3F1C * 8 + 7)
#define                                 SMT1PR15_bit        _BIT_ACCESS(SMT1PRH,7)
// SMT1PRU<SMT1PR16>
extern volatile __bit                   SMT1PR16            __at(0x1F8E8);	// @ (0x3F1D * 8 + 0)
#define                                 SMT1PR16_bit        _BIT_ACCESS(SMT1PRU,0)
// SMT1PRU<SMT1PR17>
extern volatile __bit                   SMT1PR17            __at(0x1F8E9);	// @ (0x3F1D * 8 + 1)
#define                                 SMT1PR17_bit        _BIT_ACCESS(SMT1PRU,1)
// SMT1PRU<SMT1PR18>
extern volatile __bit                   SMT1PR18            __at(0x1F8EA);	// @ (0x3F1D * 8 + 2)
#define                                 SMT1PR18_bit        _BIT_ACCESS(SMT1PRU,2)
// SMT1PRU<SMT1PR19>
extern volatile __bit                   SMT1PR19            __at(0x1F8EB);	// @ (0x3F1D * 8 + 3)
#define                                 SMT1PR19_bit        _BIT_ACCESS(SMT1PRU,3)
// SMT1PRL<SMT1PR2>
extern volatile __bit                   SMT1PR2             __at(0x1F8DA);	// @ (0x3F1B * 8 + 2)
#define                                 SMT1PR2_bit         _BIT_ACCESS(SMT1PRL,2)
// SMT1PRU<SMT1PR20>
extern volatile __bit                   SMT1PR20            __at(0x1F8EC);	// @ (0x3F1D * 8 + 4)
#define                                 SMT1PR20_bit        _BIT_ACCESS(SMT1PRU,4)
// SMT1PRU<SMT1PR21>
extern volatile __bit                   SMT1PR21            __at(0x1F8ED);	// @ (0x3F1D * 8 + 5)
#define                                 SMT1PR21_bit        _BIT_ACCESS(SMT1PRU,5)
// SMT1PRU<SMT1PR22>
extern volatile __bit                   SMT1PR22            __at(0x1F8EE);	// @ (0x3F1D * 8 + 6)
#define                                 SMT1PR22_bit        _BIT_ACCESS(SMT1PRU,6)
// SMT1PRU<SMT1PR23>
extern volatile __bit                   SMT1PR23            __at(0x1F8EF);	// @ (0x3F1D * 8 + 7)
#define                                 SMT1PR23_bit        _BIT_ACCESS(SMT1PRU,7)
// SMT1PRL<SMT1PR3>
extern volatile __bit                   SMT1PR3             __at(0x1F8DB);	// @ (0x3F1B * 8 + 3)
#define                                 SMT1PR3_bit         _BIT_ACCESS(SMT1PRL,3)
// SMT1PRL<SMT1PR4>
extern volatile __bit                   SMT1PR4             __at(0x1F8DC);	// @ (0x3F1B * 8 + 4)
#define                                 SMT1PR4_bit         _BIT_ACCESS(SMT1PRL,4)
// SMT1PRL<SMT1PR5>
extern volatile __bit                   SMT1PR5             __at(0x1F8DD);	// @ (0x3F1B * 8 + 5)
#define                                 SMT1PR5_bit         _BIT_ACCESS(SMT1PRL,5)
// SMT1PRL<SMT1PR6>
extern volatile __bit                   SMT1PR6             __at(0x1F8DE);	// @ (0x3F1B * 8 + 6)
#define                                 SMT1PR6_bit         _BIT_ACCESS(SMT1PRL,6)
// SMT1PRL<SMT1PR7>
extern volatile __bit                   SMT1PR7             __at(0x1F8DF);	// @ (0x3F1B * 8 + 7)
#define                                 SMT1PR7_bit         _BIT_ACCESS(SMT1PRL,7)
// SMT1PRH<SMT1PR8>
extern volatile __bit                   SMT1PR8             __at(0x1F8E0);	// @ (0x3F1C * 8 + 0)
#define                                 SMT1PR8_bit         _BIT_ACCESS(SMT1PRH,0)
// SMT1PRH<SMT1PR9>
extern volatile __bit                   SMT1PR9             __at(0x1F8E1);	// @ (0x3F1C * 8 + 1)
#define                                 SMT1PR9_bit         _BIT_ACCESS(SMT1PRH,1)
// PIE1<SMT1PRAIE>
extern volatile __bit                   SMT1PRAIE           __at(0x1CC8E);	// @ (0x3991 * 8 + 6)
#define                                 SMT1PRAIE_bit       _BIT_ACCESS(PIE1,6)
// PIR1<SMT1PRAIF>
extern volatile __bit                   SMT1PRAIF           __at(0x1CD0E);	// @ (0x39A1 * 8 + 6)
#define                                 SMT1PRAIF_bit       _BIT_ACCESS(PIR1,6)
// IPR1<SMT1PRAIP>
extern volatile __bit                   SMT1PRAIP           __at(0x1CC0E);	// @ (0x3981 * 8 + 6)
#define                                 SMT1PRAIP_bit       _BIT_ACCESS(IPR1,6)
// SMT1CON0<SMT1PS0>
extern volatile __bit                   SMT1PS0             __at(0x1F8F0);	// @ (0x3F1E * 8 + 0)
#define                                 SMT1PS0_bit         _BIT_ACCESS(SMT1CON0,0)
// SMT1CON0<SMT1PS1>
extern volatile __bit                   SMT1PS1             __at(0x1F8F1);	// @ (0x3F1E * 8 + 1)
#define                                 SMT1PS1_bit         _BIT_ACCESS(SMT1CON0,1)
// PIE1<SMT1PWAIE>
extern volatile __bit                   SMT1PWAIE           __at(0x1CC8F);	// @ (0x3991 * 8 + 7)
#define                                 SMT1PWAIE_bit       _BIT_ACCESS(PIE1,7)
// PIR1<SMT1PWAIF>
extern volatile __bit                   SMT1PWAIF           __at(0x1CD0F);	// @ (0x39A1 * 8 + 7)
#define                                 SMT1PWAIF_bit       _BIT_ACCESS(PIR1,7)
// IPR1<SMT1PWAIP>
extern volatile __bit                   SMT1PWAIP           __at(0x1CC0F);	// @ (0x3981 * 8 + 7)
#define                                 SMT1PWAIP_bit       _BIT_ACCESS(IPR1,7)
// SMT1CON1<SMT1REPEAT>
extern volatile __bit                   SMT1REPEAT          __at(0x1F8FE);	// @ (0x3F1F * 8 + 6)
#define                                 SMT1REPEAT_bit      _BIT_ACCESS(SMT1CON1,6)
// SMT1STAT<SMT1RESET>
extern volatile __bit                   SMT1RESET           __at(0x1F905);	// @ (0x3F20 * 8 + 5)
#define                                 SMT1RESET_bit       _BIT_ACCESS(SMT1STAT,5)
// SMT1STAT<SMT1RST>
extern volatile __bit                   SMT1RST             __at(0x1F905);	// @ (0x3F20 * 8 + 5)
#define                                 SMT1RST_bit         _BIT_ACCESS(SMT1STAT,5)
// SMT1CON0<SMT1SPOL>
extern volatile __bit                   SMT1SPOL            __at(0x1F8F3);	// @ (0x3F1E * 8 + 3)
#define                                 SMT1SPOL_bit        _BIT_ACCESS(SMT1CON0,3)
// SMT1SIG<SMT1SSEL0>
extern volatile __bit                   SMT1SSEL0           __at(0x1F910);	// @ (0x3F22 * 8 + 0)
#define                                 SMT1SSEL0_bit       _BIT_ACCESS(SMT1SIG,0)
// SMT1SIG<SMT1SSEL1>
extern volatile __bit                   SMT1SSEL1           __at(0x1F911);	// @ (0x3F22 * 8 + 1)
#define                                 SMT1SSEL1_bit       _BIT_ACCESS(SMT1SIG,1)
// SMT1SIG<SMT1SSEL2>
extern volatile __bit                   SMT1SSEL2           __at(0x1F912);	// @ (0x3F22 * 8 + 2)
#define                                 SMT1SSEL2_bit       _BIT_ACCESS(SMT1SIG,2)
// SMT1SIG<SMT1SSEL3>
extern volatile __bit                   SMT1SSEL3           __at(0x1F913);	// @ (0x3F22 * 8 + 3)
#define                                 SMT1SSEL3_bit       _BIT_ACCESS(SMT1SIG,3)
// SMT1SIG<SMT1SSEL4>
extern volatile __bit                   SMT1SSEL4           __at(0x1F914);	// @ (0x3F22 * 8 + 4)
#define                                 SMT1SSEL4_bit       _BIT_ACCESS(SMT1SIG,4)
// SMT1CON0<SMT1STP>
extern volatile __bit                   SMT1STP             __at(0x1F8F5);	// @ (0x3F1E * 8 + 5)
#define                                 SMT1STP_bit         _BIT_ACCESS(SMT1CON0,5)
// SMT1TMRL<SMT1TMR0>
extern volatile __bit                   SMT1TMR0            __at(0x1F890);	// @ (0x3F12 * 8 + 0)
#define                                 SMT1TMR0_bit        _BIT_ACCESS(SMT1TMRL,0)
// SMT1TMRL<SMT1TMR1>
extern volatile __bit                   SMT1TMR1            __at(0x1F891);	// @ (0x3F12 * 8 + 1)
#define                                 SMT1TMR1_bit        _BIT_ACCESS(SMT1TMRL,1)
// SMT1TMRH<SMT1TMR10>
extern volatile __bit                   SMT1TMR10           __at(0x1F89A);	// @ (0x3F13 * 8 + 2)
#define                                 SMT1TMR10_bit       _BIT_ACCESS(SMT1TMRH,2)
// SMT1TMRH<SMT1TMR11>
extern volatile __bit                   SMT1TMR11           __at(0x1F89B);	// @ (0x3F13 * 8 + 3)
#define                                 SMT1TMR11_bit       _BIT_ACCESS(SMT1TMRH,3)
// SMT1TMRH<SMT1TMR12>
extern volatile __bit                   SMT1TMR12           __at(0x1F89C);	// @ (0x3F13 * 8 + 4)
#define                                 SMT1TMR12_bit       _BIT_ACCESS(SMT1TMRH,4)
// SMT1TMRH<SMT1TMR13>
extern volatile __bit                   SMT1TMR13           __at(0x1F89D);	// @ (0x3F13 * 8 + 5)
#define                                 SMT1TMR13_bit       _BIT_ACCESS(SMT1TMRH,5)
// SMT1TMRH<SMT1TMR14>
extern volatile __bit                   SMT1TMR14           __at(0x1F89E);	// @ (0x3F13 * 8 + 6)
#define                                 SMT1TMR14_bit       _BIT_ACCESS(SMT1TMRH,6)
// SMT1TMRH<SMT1TMR15>
extern volatile __bit                   SMT1TMR15           __at(0x1F89F);	// @ (0x3F13 * 8 + 7)
#define                                 SMT1TMR15_bit       _BIT_ACCESS(SMT1TMRH,7)
// SMT1TMRU<SMT1TMR16>
extern volatile __bit                   SMT1TMR16           __at(0x1F8A0);	// @ (0x3F14 * 8 + 0)
#define                                 SMT1TMR16_bit       _BIT_ACCESS(SMT1TMRU,0)
// SMT1TMRU<SMT1TMR17>
extern volatile __bit                   SMT1TMR17           __at(0x1F8A1);	// @ (0x3F14 * 8 + 1)
#define                                 SMT1TMR17_bit       _BIT_ACCESS(SMT1TMRU,1)
// SMT1TMRU<SMT1TMR18>
extern volatile __bit                   SMT1TMR18           __at(0x1F8A2);	// @ (0x3F14 * 8 + 2)
#define                                 SMT1TMR18_bit       _BIT_ACCESS(SMT1TMRU,2)
// SMT1TMRU<SMT1TMR19>
extern volatile __bit                   SMT1TMR19           __at(0x1F8A3);	// @ (0x3F14 * 8 + 3)
#define                                 SMT1TMR19_bit       _BIT_ACCESS(SMT1TMRU,3)
// SMT1TMRL<SMT1TMR2>
extern volatile __bit                   SMT1TMR2            __at(0x1F892);	// @ (0x3F12 * 8 + 2)
#define                                 SMT1TMR2_bit        _BIT_ACCESS(SMT1TMRL,2)
// SMT1TMRU<SMT1TMR20>
extern volatile __bit                   SMT1TMR20           __at(0x1F8A4);	// @ (0x3F14 * 8 + 4)
#define                                 SMT1TMR20_bit       _BIT_ACCESS(SMT1TMRU,4)
// SMT1TMRU<SMT1TMR21>
extern volatile __bit                   SMT1TMR21           __at(0x1F8A5);	// @ (0x3F14 * 8 + 5)
#define                                 SMT1TMR21_bit       _BIT_ACCESS(SMT1TMRU,5)
// SMT1TMRU<SMT1TMR22>
extern volatile __bit                   SMT1TMR22           __at(0x1F8A6);	// @ (0x3F14 * 8 + 6)
#define                                 SMT1TMR22_bit       _BIT_ACCESS(SMT1TMRU,6)
// SMT1TMRU<SMT1TMR23>
extern volatile __bit                   SMT1TMR23           __at(0x1F8A7);	// @ (0x3F14 * 8 + 7)
#define                                 SMT1TMR23_bit       _BIT_ACCESS(SMT1TMRU,7)
// SMT1TMRL<SMT1TMR3>
extern volatile __bit                   SMT1TMR3            __at(0x1F893);	// @ (0x3F12 * 8 + 3)
#define                                 SMT1TMR3_bit        _BIT_ACCESS(SMT1TMRL,3)
// SMT1TMRL<SMT1TMR4>
extern volatile __bit                   SMT1TMR4            __at(0x1F894);	// @ (0x3F12 * 8 + 4)
#define                                 SMT1TMR4_bit        _BIT_ACCESS(SMT1TMRL,4)
// SMT1TMRL<SMT1TMR5>
extern volatile __bit                   SMT1TMR5            __at(0x1F895);	// @ (0x3F12 * 8 + 5)
#define                                 SMT1TMR5_bit        _BIT_ACCESS(SMT1TMRL,5)
// SMT1TMRL<SMT1TMR6>
extern volatile __bit                   SMT1TMR6            __at(0x1F896);	// @ (0x3F12 * 8 + 6)
#define                                 SMT1TMR6_bit        _BIT_ACCESS(SMT1TMRL,6)
// SMT1TMRL<SMT1TMR7>
extern volatile __bit                   SMT1TMR7            __at(0x1F897);	// @ (0x3F12 * 8 + 7)
#define                                 SMT1TMR7_bit        _BIT_ACCESS(SMT1TMRL,7)
// SMT1TMRH<SMT1TMR8>
extern volatile __bit                   SMT1TMR8            __at(0x1F898);	// @ (0x3F13 * 8 + 0)
#define                                 SMT1TMR8_bit        _BIT_ACCESS(SMT1TMRH,0)
// SMT1TMRH<SMT1TMR9>
extern volatile __bit                   SMT1TMR9            __at(0x1F899);	// @ (0x3F13 * 8 + 1)
#define                                 SMT1TMR9_bit        _BIT_ACCESS(SMT1TMRH,1)
// SMT1STAT<SMT1TS>
extern volatile __bit                   SMT1TS              __at(0x1F902);	// @ (0x3F20 * 8 + 2)
#define                                 SMT1TS_bit          _BIT_ACCESS(SMT1STAT,2)
// SMT1CON0<SMT1WOL>
extern volatile __bit                   SMT1WOL             __at(0x1F8F4);	// @ (0x3F1E * 8 + 4)
#define                                 SMT1WOL_bit         _BIT_ACCESS(SMT1CON0,4)
// SMT1STAT<SMT1WS>
extern volatile __bit                   SMT1WS              __at(0x1F901);	// @ (0x3F20 * 8 + 1)
#define                                 SMT1WS_bit          _BIT_ACCESS(SMT1STAT,1)
// SMT1WIN<SMT1WSEL0>
extern volatile __bit                   SMT1WSEL0           __at(0x1F918);	// @ (0x3F23 * 8 + 0)
#define                                 SMT1WSEL0_bit       _BIT_ACCESS(SMT1WIN,0)
// SMT1WIN<SMT1WSEL1>
extern volatile __bit                   SMT1WSEL1           __at(0x1F919);	// @ (0x3F23 * 8 + 1)
#define                                 SMT1WSEL1_bit       _BIT_ACCESS(SMT1WIN,1)
// SMT1WIN<SMT1WSEL2>
extern volatile __bit                   SMT1WSEL2           __at(0x1F91A);	// @ (0x3F23 * 8 + 2)
#define                                 SMT1WSEL2_bit       _BIT_ACCESS(SMT1WIN,2)
// SMT1WIN<SMT1WSEL3>
extern volatile __bit                   SMT1WSEL3           __at(0x1F91B);	// @ (0x3F23 * 8 + 3)
#define                                 SMT1WSEL3_bit       _BIT_ACCESS(SMT1WIN,3)
// SMT1WIN<SMT1WSEL4>
extern volatile __bit                   SMT1WSEL4           __at(0x1F91C);	// @ (0x3F23 * 8 + 4)
#define                                 SMT1WSEL4_bit       _BIT_ACCESS(SMT1WIN,4)
// ADCON3<SOI>
extern volatile __bit                   SOI                 __at(0x1F7DB);	// @ (0x3EFB * 8 + 3)
#define                                 SOI_bit             _BIT_ACCESS(ADCON3,3)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x1CEE3);	// @ (0x39DC * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x1CEEB);	// @ (0x39DD * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x1CEDE);	// @ (0x39DB * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// SPI1INTE<SOSIE>
extern volatile __bit                   SOSIE               __at(0x1E8DD);	// @ (0x3D1B * 8 + 5)
#define                                 SOSIE_bit           _BIT_ACCESS(SPI1INTE,5)
// SPI1INTF<SOSIF>
extern volatile __bit                   SOSIF               __at(0x1E8D5);	// @ (0x3D1A * 8 + 5)
#define                                 SOSIF_bit           _BIT_ACCESS(SPI1INTF,5)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x1FFE0);	// @ (0x3FFC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x1FFE1);	// @ (0x3FFC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x1FFE2);	// @ (0x3FFC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x1FFE3);	// @ (0x3FFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x1FFE4);	// @ (0x3FFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// SPI1CON0<SPI1BMODE>
extern volatile __bit                   SPI1BMODE           __at(0x1E8A0);	// @ (0x3D14 * 8 + 0)
#define                                 SPI1BMODE_bit       _BIT_ACCESS(SPI1CON0,0)
// SPI1CON2<SPI1BUSY>
extern volatile __bit                   SPI1BUSY            __at(0x1E8B7);	// @ (0x3D16 * 8 + 7)
#define                                 SPI1BUSY_bit        _BIT_ACCESS(SPI1CON2,7)
// SPI1CON1<SPI1CKE>
extern volatile __bit                   SPI1CKE             __at(0x1E8AE);	// @ (0x3D15 * 8 + 6)
#define                                 SPI1CKE_bit         _BIT_ACCESS(SPI1CON1,6)
// SPI1CON1<SPI1CKP>
extern volatile __bit                   SPI1CKP             __at(0x1E8AD);	// @ (0x3D15 * 8 + 5)
#define                                 SPI1CKP_bit         _BIT_ACCESS(SPI1CON1,5)
// SPI1CLK<SPI1CLKSEL0>
extern volatile __bit                   SPI1CLKSEL0         __at(0x1E8E0);	// @ (0x3D1C * 8 + 0)
#define                                 SPI1CLKSEL0_bit     _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<SPI1CLKSEL1>
extern volatile __bit                   SPI1CLKSEL1         __at(0x1E8E1);	// @ (0x3D1C * 8 + 1)
#define                                 SPI1CLKSEL1_bit     _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<SPI1CLKSEL2>
extern volatile __bit                   SPI1CLKSEL2         __at(0x1E8E2);	// @ (0x3D1C * 8 + 2)
#define                                 SPI1CLKSEL2_bit     _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<SPI1CLKSEL3>
extern volatile __bit                   SPI1CLKSEL3         __at(0x1E8E3);	// @ (0x3D1C * 8 + 3)
#define                                 SPI1CLKSEL3_bit     _BIT_ACCESS(SPI1CLK,3)
// SPI1STATUS<SPI1CLRBF>
extern volatile __bit                   SPI1CLRBF           __at(0x1E8BA);	// @ (0x3D17 * 8 + 2)
#define                                 SPI1CLRBF_bit       _BIT_ACCESS(SPI1STATUS,2)
// SPI1INTE<SPI1EOSIE>
extern volatile __bit                   SPI1EOSIE           __at(0x1E8DC);	// @ (0x3D1B * 8 + 4)
#define                                 SPI1EOSIE_bit       _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<SPI1EOSIF>
extern volatile __bit                   SPI1EOSIF           __at(0x1E8D4);	// @ (0x3D1A * 8 + 4)
#define                                 SPI1EOSIF_bit       _BIT_ACCESS(SPI1INTF,4)
// SPI1CON1<SPI1FST>
extern volatile __bit                   SPI1FST             __at(0x1E8AC);	// @ (0x3D15 * 8 + 4)
#define                                 SPI1FST_bit         _BIT_ACCESS(SPI1CON1,4)
// PIE2<SPI1IE>
extern volatile __bit                   SPI1IE              __at(0x1CC96);	// @ (0x3992 * 8 + 6)
#define                                 SPI1IE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<SPI1IF>
extern volatile __bit                   SPI1IF              __at(0x1CD16);	// @ (0x39A2 * 8 + 6)
#define                                 SPI1IF_bit          _BIT_ACCESS(PIR2,6)
// IPR2<SPI1IP>
extern volatile __bit                   SPI1IP              __at(0x1CC16);	// @ (0x3982 * 8 + 6)
#define                                 SPI1IP_bit          _BIT_ACCESS(IPR2,6)
// SPI1CON0<SPI1LSBF>
extern volatile __bit                   SPI1LSBF            __at(0x1E8A2);	// @ (0x3D14 * 8 + 2)
#define                                 SPI1LSBF_bit        _BIT_ACCESS(SPI1CON0,2)
// PMD5<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x1CE2A);	// @ (0x39C5 * 8 + 2)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD5,2)
// SPI1CON0<SPI1MST>
extern volatile __bit                   SPI1MST             __at(0x1E8A1);	// @ (0x3D14 * 8 + 1)
#define                                 SPI1MST_bit         _BIT_ACCESS(SPI1CON0,1)
// SPI1STATUS<SPI1RXBF>
extern volatile __bit                   SPI1RXBF            __at(0x1E8B8);	// @ (0x3D17 * 8 + 0)
#define                                 SPI1RXBF_bit        _BIT_ACCESS(SPI1STATUS,0)
// PIE2<SPI1RXIE>
extern volatile __bit                   SPI1RXIE            __at(0x1CC94);	// @ (0x3992 * 8 + 4)
#define                                 SPI1RXIE_bit        _BIT_ACCESS(PIE2,4)
// PIR2<SPI1RXIF>
extern volatile __bit                   SPI1RXIF            __at(0x1CD14);	// @ (0x39A2 * 8 + 4)
#define                                 SPI1RXIF_bit        _BIT_ACCESS(PIR2,4)
// IPR2<SPI1RXIP>
extern volatile __bit                   SPI1RXIP            __at(0x1CC14);	// @ (0x3982 * 8 + 4)
#define                                 SPI1RXIP_bit        _BIT_ACCESS(IPR2,4)
// SPI1INTE<SPI1RXOIE>
extern volatile __bit                   SPI1RXOIE           __at(0x1E8DA);	// @ (0x3D1B * 8 + 2)
#define                                 SPI1RXOIE_bit       _BIT_ACCESS(SPI1INTE,2)
// SPI1INTF<SPI1RXOIF>
extern volatile __bit                   SPI1RXOIF           __at(0x1E8D2);	// @ (0x3D1A * 8 + 2)
#define                                 SPI1RXOIF_bit       _BIT_ACCESS(SPI1INTF,2)
// SPI1CON2<SPI1RXR>
extern volatile __bit                   SPI1RXR             __at(0x1E8B0);	// @ (0x3D16 * 8 + 0)
#define                                 SPI1RXR_bit         _BIT_ACCESS(SPI1CON2,0)
// SPI1STATUS<SPI1RXRE>
extern volatile __bit                   SPI1RXRE            __at(0x1E8BB);	// @ (0x3D17 * 8 + 3)
#define                                 SPI1RXRE_bit        _BIT_ACCESS(SPI1STATUS,3)
// SPI1CON1<SPI1SDIP>
extern volatile __bit                   SPI1SDIP            __at(0x1E8A9);	// @ (0x3D15 * 8 + 1)
#define                                 SPI1SDIP_bit        _BIT_ACCESS(SPI1CON1,1)
// SPI1CON1<SPI1SDOP>
extern volatile __bit                   SPI1SDOP            __at(0x1E8A8);	// @ (0x3D15 * 8 + 0)
#define                                 SPI1SDOP_bit        _BIT_ACCESS(SPI1CON1,0)
// SPI1CON1<SPI1SMP>
extern volatile __bit                   SPI1SMP             __at(0x1E8AF);	// @ (0x3D15 * 8 + 7)
#define                                 SPI1SMP_bit         _BIT_ACCESS(SPI1CON1,7)
// SPI1INTE<SPI1SOSIE>
extern volatile __bit                   SPI1SOSIE           __at(0x1E8DD);	// @ (0x3D1B * 8 + 5)
#define                                 SPI1SOSIE_bit       _BIT_ACCESS(SPI1INTE,5)
// SPI1INTF<SPI1SOSIF>
extern volatile __bit                   SPI1SOSIF           __at(0x1E8D5);	// @ (0x3D1A * 8 + 5)
#define                                 SPI1SOSIF_bit       _BIT_ACCESS(SPI1INTF,5)
// SPI1CON0<SPI1SPIEN>
extern volatile __bit                   SPI1SPIEN           __at(0x1E8A7);	// @ (0x3D14 * 8 + 7)
#define                                 SPI1SPIEN_bit       _BIT_ACCESS(SPI1CON0,7)
// SPI1INTE<SPI1SRMTIE>
extern volatile __bit                   SPI1SRMTIE          __at(0x1E8DF);	// @ (0x3D1B * 8 + 7)
#define                                 SPI1SRMTIE_bit      _BIT_ACCESS(SPI1INTE,7)
// SPI1INTF<SPI1SRMTIF>
extern volatile __bit                   SPI1SRMTIF          __at(0x1E8D7);	// @ (0x3D1A * 8 + 7)
#define                                 SPI1SRMTIF_bit      _BIT_ACCESS(SPI1INTF,7)
// SPI1CON2<SPI1SSET>
extern volatile __bit                   SPI1SSET            __at(0x1E8B2);	// @ (0x3D16 * 8 + 2)
#define                                 SPI1SSET_bit        _BIT_ACCESS(SPI1CON2,2)
// SPI1CON2<SPI1SSFLT>
extern volatile __bit                   SPI1SSFLT           __at(0x1E8B6);	// @ (0x3D16 * 8 + 6)
#define                                 SPI1SSFLT_bit       _BIT_ACCESS(SPI1CON2,6)
// SPI1CON1<SPI1SSP>
extern volatile __bit                   SPI1SSP             __at(0x1E8AA);	// @ (0x3D15 * 8 + 2)
#define                                 SPI1SSP_bit         _BIT_ACCESS(SPI1CON1,2)
// SPI1INTE<SPI1TCZIE>
extern volatile __bit                   SPI1TCZIE           __at(0x1E8DE);	// @ (0x3D1B * 8 + 6)
#define                                 SPI1TCZIE_bit       _BIT_ACCESS(SPI1INTE,6)
// SPI1INTF<SPI1TCZIF>
